garyPenhook/PyAvrOCD/svd/avr64da64s.svd
        <register>
          <name>USERUSART0IRDA</name>
          <description>User 21 - USART0</description>
          <addressOffset>0x35</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART1IRDA</name>
          <description>User 22 - USART1</description>
          <addressOffset>0x36</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART2IRDA</name>
          <description>User 23 - USART2</description>
          <addressOffset>0x37</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART3IRDA</name>
          <description>User 24 - USART3</description>
          <addressOffset>0x38</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART4IRDA</name>
          <description>User 25 - USART4</description>
          <addressOffset>0x39</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERUSART5IRDA</name>
          <description>User 26 - USART5</description>
          <addressOffset>0x3A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
